In [2]:
import pandas as pd
import numpy as np

1. Creating DataFrames

In [9]:
dt = {
    'Name':['Alice','Bob','Charlie','Diana'],
    'Age':[23,25,22,24],
    'Gender':['Female','Male','Male','Female'],
    'Score':[85,78,90,92]
}
df = pd.DataFrame(dt)
df

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90
3    Diana   24  Female     92

1.Display the first 3 rows of the DataFrame.

In [10]:
df.head(3)

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90

2. Get the column names and data types.

In [11]:
df.dtypes

Name      object
Age        int64
Gender    object
Score      int64
dtype: object

3. Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False.

In [13]:
df['Passed'] = df.Score>80
df

      Name  Age  Gender  Score  Passed
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

4. Drop the Gender column from the DataFrame.

In [24]:
df.drop('Gender',axis=1)

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

2. Indexing and Slicing
   1. Select and display only the Name and Score columns.

In [28]:
df.loc[:,['Name','Score']]

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    Diana     92

2. Indexing and Slicing
   2. Filter and display rows where Score is greater than 85.

In [29]:
df.loc[df.Score>85]

      Name  Age  Gender  Score  Passed
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

2. Indexing and Slicing
   3. Display the row for the student named "Bob" using loc.

In [30]:
df.loc[df.Name=='Bob']

  Name  Age Gender  Score  Passed
1  Bob   25   Male     78   False

3. Indexing and Slicing
   4. Display the last 2 rows of the DataFrame.

In [31]:
df.iloc[-2:]

      Name  Age  Gender  Score  Passed
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

3. Data Analysis
   1. Calculate the average age of students.

In [33]:
print(df.Age.mean())

23.5

3. Data Analysis
   2. Find the maximum and minimum scores.

In [35]:
print(f"Maximum Score: {df.Score.max()}")
print(f"Minimum Score: {df.Score.min()}")

Maximum Score: 92
Minimum Score: 78

3. Data Analysis
   3. Count the number of students who passed.

In [39]:
ct = (df.Passed==True).sum()
print(ct)

3

3. Data Analysis
   4. Group the data by the Passed column and calculate the average score for each group.

In [41]:
df.groupby('Passed').Score.mean()

Passed
False    78.0
True     89.0
Name: Score, dtype: float64

4. Data Analysis
   5. Sort the DataFrame by Score in descending order.

In [47]:
df.sort_values(by='Score',ascending=False)

      Name  Age  Gender  Score  Passed
3    Diana   24  Female     92    True
2  Charlie   22    Male     90    True
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False

5. Importing and Exporting Data
   1. Save the DataFrame from Task 1 as a CSV file named students.csv.

In [49]:
df.to_csv("students.csv")

5. Importing and Exporting Data
   2. Read the students.csv file back into a new DataFrame and display it.

In [50]:
new_df = pd.read_csv(r"students.csv")
new_df

   Unnamed: 0     Name  Age  Gender  Score  Passed
0           0    Alice   23  Female     85    True
1           1      Bob   25    Male     78   False
2           2  Charlie   22    Male     90    True
3           3    Diana   24  Female     92    True

6. Real World Problem
   Creating Data Frame

In [51]:
dic1 = {
    'Product':['Laptop','Smartphone','Desk','Chair'],
    'Category':['Electronics','Electronics','Furniture','Furniture'],
    'Sales':[500,300,200,150],
    'Discount':[50,30,20,15]
}
df1 = pd.DataFrame(dic1)
df1

      Product     Category  Sales  Discount
0      Laptop  Electronics    500        50
1  Smartphone  Electronics    300        30
2        Desk    Furniture    200        20
3       Chair    Furniture    150        15

6. Real World Problem
   1. Calculate a new column named Net Sales as Sales - Discount.

In [54]:
df1['Net Sales'] = df1.Sales-df1.Discount
df1

      Product     Category  Sales  Discount  Net Sales
0      Laptop  Electronics    500        50        450
1  Smartphone  Electronics    300        30        270
2        Desk    Furniture    200        20        180
3       Chair    Furniture    150        15        135

6. Real World Problem
   2. Group the data by Category and calculate total sales for each category.

In [55]:
df1.groupby('Category').Sales.sum()

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

In [63]:
ndf1 = df1.sort_values(by='Net Sales',ascending=False)
ndf1.iloc[0]['Product']

'Laptop'